content/posts/A_Class_of_Models_with_the_Potential_to_Represent_Fundamental_Physics_by_Stephen_Wolfram_in_2020.md
+++
title = "A Class of Models with the Potential to Represent Fundamental Physics by Stephen Wolfram in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:33:36-04:00
slug = "A_Class_of_Models_with_the_Potential_to_Represent_Fundamental_Physics_by_Stephen_Wolfram_in_2020"
draft = false
+++

## 1. Introduction {#1-dot-introduction}


## 2. Basic form of models {#2-dot-basic-form-of-models}


### 2.1 Basic structure {#2-dot-1-basic-structure}


### 2.2 First example of a rule {#2-dot-2-first-example-of-a-rule}


### 2.3 A slightly different rule {#2-dot-3-a-slightly-different-rule}


### 2.4 Self-loops {#2-dot-4-self-loops}


### 2.5 Multiedges {#2-dot-5-multiedges}


### 2.6 The representation of rules {#2-dot-6-the-representation-of-rules}


### 2.7 Rules depending on more than one relation {#2-dot-7-rules-depending-on-more-than-one-relation}


### 2.8 Termination {#2-dot-8-termination}


### 2.9 Connectedness {#2-dot-9-connectedness}


## 3. Typical behaviors {#3-dot-typical-behaviors}


### 3.1 The representation of rules {#3-dot-1-the-representation-of-rules}


### 3.2 The number of possible rules {#3-dot-2-the-number-of-possible-rules}


### 3.3 Initial conditions {#3-dot-3-initial-conditions}


### 3.4 Rules depending on a single unary relation {#3-dot-4-rules-depending-on-a-single-unary-relation}


### 3.5 Rules depending on a single binary relation {#3-dot-5-rules-depending-on-a-single-binary-relation}


### 3.6 Rules depending on one ternary relation {#3-dot-6-rules-depending-on-one-ternary-relation}


### 3.7 Rules depending on more than one relation: the \\[2\_2 \rightarrow 3\_2\\] case {#3-dot-7-rules-depending-on-more-than-one-relation-the-2-2-rightarrow-3-2-case}


### 3.8 Rules with signature \\[2\_2 \rightarrow 4\_2\\] {#3-dot-8-rules-with-signature-2-2-rightarrow-4-2}


### 3.9 Binary rules with signatures beyond \\[2\_2 \rightarrow 4\_2\\] {#3-dot-9-binary-rules-with-signatures-beyond-2-2-rightarrow-4-2}


### 3.10 Rules depending on two ternary relations: the \\[2\_3 \rightarrow 3\_3\\] case {#3-dot-10-rules-depending-on-two-ternary-relations-the-2-3-rightarrow-3-3-case}


### 3.11 Rules involving more ternary relations {#3-dot-11-rules-involving-more-ternary-relations}


### 3.12 Rules with mixed arity {#3-dot-12-rules-with-mixed-arity}


### 3.13 Multiple transformation rules {#3-dot-13-multiple-transformation-rules}


### 3.14 Rules involving disconnected pieces {#3-dot-14-rules-involving-disconnected-pieces}


### 3.15 Termination {#3-dot-15-termination}


### 3.16 The effect of initial conditions {#3-dot-16-the-effect-of-initial-conditions}


### 3.17 Behavior without growth {#3-dot-17-behavior-without-growth}


### 3.18 Random rules and overall classification of behavior {#3-dot-18-random-rules-and-overall-classification-of-behavior}


## 4. Limiting behavior and emergent geometry {#4-dot-limiting-behavior-and-emergent-geometry}


### 4.1 Recognizable geometry {#4-dot-1-recognizable-geometry}


### 4.2 Hyperbolic space {#4-dot-2-hyperbolic-space}


### 4.3 Geometry from subdivision {#4-dot-3-geometry-from-subdivision}


### 4.4 Nested patterns {#4-dot-4-nested-patterns}


### 4.5 The notion of dimension {#4-dot-5-the-notion-of-dimension}


### 4.6 Dimension-related characterizations {#4-dot-6-dimension-related-characterizations}


### 4.7 Curvature {#4-dot-7-curvature}


### 4.8 Homogeneity and local graph neighborhoods {#4-dot-8-homogeneity-and-local-graph-neighborhoods}


### 4.9 Adjacency matrices and age distributions {#4-dot-9-adjacency-matrices-and-age-distributions}


### 4.10 Other graph properties {#4-dot-10-other-graph-properties}


### 4.11 Graph properties conserved by rules {#4-dot-11-graph-properties-conserved-by-rules}


### 4.12 Apparent randomness and growth rates {#4-dot-12-apparent-randomness-and-growth-rates}


### 4.13 Statistical mechanics {#4-dot-13-statistical-mechanics}


### 4.14 The effect of perturbations {#4-dot-14-the-effect-of-perturbations}


### 4.15 Geodesics {#4-dot-15-geodesics}


### 4.16 Functions on graphs {#4-dot-16-functions-on-graphs}


### 4.17 Manifolds and model spaces {#4-dot-17-manifolds-and-model-spaces}


## 5. The updating process for string substitution systems {#5-dot-the-updating-process-for-string-substitution-systems}


### 5.1 String substitution systems {#5-dot-1-string-substitution-systems}


### 5.2 The phenomenon of causal invariance {#5-dot-2-the-phenomenon-of-causal-invariance}


### 5.3 States graphs {#5-dot-3-states-graphs}


### 5.4 Typical multiway graph structures {#5-dot-4-typical-multiway-graph-structures}


### 5.5 Testing for causal invariance {#5-dot-5-testing-for-causal-invariance}


### 5.6 The frequency of causal invariance {#5-dot-6-the-frequency-of-causal-invariance}


### 5.7 Events and their causal relationships {#5-dot-7-events-and-their-causal-relationships}


### 5.8 Causal graphs for particular updating sequences {#5-dot-8-causal-graphs-for-particular-updating-sequences}


### 5.9 The significance of causal invariance {#5-dot-9-the-significance-of-causal-invariance}


### 5.10 Causal foliations and causal cones {#5-dot-10-causal-foliations-and-causal-cones}


### 5.11 Causal graphs for infinite evolutions {#5-dot-11-causal-graphs-for-infinite-evolutions}


### 5.12 Typical causal graphs {#5-dot-12-typical-causal-graphs}


### 5.13 Limits of causal graphs {#5-dot-13-limits-of-causal-graphs}


### 5.14 Foliations and coordinates on causal graphs {#5-dot-14-foliations-and-coordinates-on-causal-graphs}


### 5.15 The concept of branchial graphs {#5-dot-15-the-concept-of-branchial-graphs}


### 5.16 Typical forms of branchial graphs {#5-dot-16-typical-forms-of-branchial-graphs}


### 5.17 Foliations of the multiway graph and the structure of branchial space {#5-dot-17-foliations-of-the-multiway-graph-and-the-structure-of-branchial-space}


### 5.18 The relationship between graphs and the multiway causal graph {#5-dot-18-the-relationship-between-graphs-and-the-multiway-causal-graph}


### 5.19 Weighted multiway graphs {#5-dot-19-weighted-multiway-graphs}


### 5.20 Effective causal invarance {#5-dot-20-effective-causal-invarance}


### 5.21 Generational evolution {#5-dot-21-generational-evolution}


## 6. The updating process in our models {#6-dot-the-updating-process-in-our-models}


### 6.1 Updating events and causal dependence {#6-dot-1-updating-events-and-causal-dependence}


### 6.2 Multiway systems for our models {#6-dot-2-multiway-systems-for-our-models}


### 6.3 Causal invariance {#6-dot-3-causal-invariance}


### 6.4 Testing for causal invariance {#6-dot-4-testing-for-causal-invariance}


### 6.5 Causal graphs for causal invariant rules {#6-dot-5-causal-graphs-for-causal-invariant-rules}


### 6.6 The role of causal graphs {#6-dot-6-the-role-of-causal-graphs}


### 6.7 Typical causal graphs {#6-dot-7-typical-causal-graphs}


### 6.8 Large-scale structure of causal graphs {#6-dot-8-large-scale-structure-of-causal-graphs}


### 6.9 Foliations of causal graphs {#6-dot-9-foliations-of-causal-graphs}


### 6.10 Causal disconnection {#6-dot-10-causal-disconnection}


### 6.11 Global symmetries and conservation laws {#6-dot-11-global-symmetries-and-conservation-laws}


### 6.12 Local symmetries {#6-dot-12-local-symmetries}


### 6.13 Branchial graphs and multiway causal graphs {#6-dot-13-branchial-graphs-and-multiway-causal-graphs}


## 7. Equivalence and computation in our models {#7-dot-equivalence-and-computation-in-our-models}


### 7.1 Correspondence with other systems {#7-dot-1-correspondence-with-other-systems}


### 7.2 Alternative formulations {#7-dot-2-alternative-formulations}


### 7.3 Computational capabilities of our models {#7-dot-3-computational-capabilities-of-our-models}


## 8. Potential relation to physics {#8-dot-potential-relation-to-physics}


### 8.1 Introduction {#8-dot-1-introduction}


### 8.2 Basic concepts {#8-dot-2-basic-concepts}


### 8.3 Potential basic translations {#8-dot-3-potential-basic-translations}


### 8.4 The structure of space {#8-dot-4-the-structure-of-space}


### 8.5 Time and spacetime {#8-dot-5-time-and-spacetime}


### 8.6 Motion and special relativity {#8-dot-6-motion-and-special-relativity}


### 8.7 The vacuum Einstein equations {#8-dot-7-the-vacuum-einstein-equations}


### 8.8 Matter, energy and gravitation {#8-dot-8-matter-energy-and-gravitation}


### 8.9 Elementary particles {#8-dot-9-elementary-particles}


### 8.10 Reversibility and irreversibility {#8-dot-10-reversibility-and-irreversibility}


### 8.11 Cosmology, expansion and singularities {#8-dot-11-cosmology-expansion-and-singularities}


### 8.12 Basic concepts of quantum mechanics {#8-dot-12-basic-concepts-of-quantum-mechanics}


### 8.13 Quantum formalism {#8-dot-13-quantum-formalism}


### 8.14 Quantum measurement {#8-dot-14-quantum-measurement}


### 8.15 Operators in quantum mechanics {#8-dot-15-operators-in-quantum-mechanics}


### 8.16 Wave-particle duality, uncertainty relations, etc. {#8-dot-16-wave-particle-duality-uncertainty-relations-etc-dot}


### 8.17 Correspondence between relativity and quantum mechanics {#8-dot-17-correspondence-between-relativity-and-quantum-mechanics}


### 8.18 Event horizons and singularities in spacetime and quantum mechanics {#8-dot-18-event-horizons-and-singularities-in-spacetime-and-quantum-mechanics}


### 8.19 Local gauge invariance {#8-dot-19-local-gauge-invariance}


### 8.20 Units and scales {#8-dot-20-units-and-scales}


### 8.21 Specific models of the universe {#8-dot-21-specific-models-of-the-universe}


### 8.22 Multiway systems in the space of all possible rules {#8-dot-22-multiway-systems-in-the-space-of-all-possible-rules}
